marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcl_TS_T2D35M10I0R0/include/Reg_eSys_eMios.h
/**
*   @file    Reg_eSys_eMios.h
*   @version 1.0.0
*
*   @brief   AUTOSAR Mcl - Brief file description (one line).
*   @details Detailed file description (can be multiple lines).
*
*   @addtogroup EMIOS_DRIVER
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : PA
*   Peripheral           : eDMA
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.0
*   Build Version        : MPC574XG_MCAL_1_0_0_RTM_ASR_REL_4_2_REV_0002_20170217
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section REG_ESYS_EMIOS_H_1
* Violates MISRA 2004 Required Rule 19.15, :  Repeated include file MemMap.h  Precautions shall be
* taken in order to prevent the contents of a header file being included twice This is not a
* violation
* since all header files are protected against multiple inclusions
*
* @section REG_ESYS_EMIOS_H_2
* Violates MISRA 2004 Advisory Rule 19.7, : Use of function like macro. This
* violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section REG_ESYS_EMIOS_H_3
* Violates MISRA 2004 Required Rule 20.2, The names of standard library macros, objects and functions
* shall not be reused
*
* @section REG_ESYS_EMIOS_H_4
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely on the
* significance of more than 31 characters.
*
* @section REG_ESYS_EMIOS_H_5
* Violates MISRA 2004 Required Rule 8.12, When an array is declared with external linkage, its size 
* shall be stated explicitly or defined implicitly by initialisation.
*
* @section REG_ESYS_EMIOS_H_6
* Violates MISRA 2004 Required Rule 8.7,
* Objects shall be defined at block scope if they are only accessed from within a single function.
*/

#ifndef REG_ESYS_EMIOS_H
#define REG_ESYS_EMIOS_H

#ifdef __cplusplus
extern "C"{
#endif

/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
/** @violates @ref REG_ESYS_EMIOS_H_1 Repeated include file MemMap.h */
#include "Reg_eSys.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @{
* @file           Reg_eSys_eMios.h
* @brief   Header file version information
*/
#define REG_ESYS_EMIOS_VENDOR_ID                          43
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define REG_ESYS_EMIOS_AR_RELEASE_MAJOR_VERSION           4
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define REG_ESYS_EMIOS_AR_RELEASE_MINOR_VERSION           2
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define REG_ESYS_EMIOS_AR_RELEASE_REVISION_VERSION        2
#define REG_ESYS_EMIOS_SW_MAJOR_VERSION                   1
#define REG_ESYS_EMIOS_SW_MINOR_VERSION                   0
#define REG_ESYS_EMIOS_SW_PATCH_VERSION                   0
/** @} */

/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/

/* Check if source file and header file are of the same Autosar version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
#if ((REG_ESYS_EMIOS_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
        (REG_ESYS_EMIOS_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION))
    #error "AutoSar Version Numbers of Reg_eSys_eMios.h and Reg_eSys.h are different"
#endif
#endif

/*==================================================================================================
                                           CONSTANTS
==================================================================================================*/

/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/
#define MCL_START_SEC_CONST_32
/** @violates @ref REG_ESYS_EMIOS_H_1 Repeated include file MemMap.h */

#include "Mcl_MemMap.h"

/**
* @brief EMIOS base address array declaration
*/

/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
@violates @ref REG_ESYS_EMIOS_H_5 Array size shall be stated explicitly
@violates @ref REG_ESYS_EMIOS_H_6 the define cannot be moved inside the block scope...
*/
extern CONST(uint32, MCL_CONST) EMIOS_BASE_ADDR32[];
#define MCL_STOP_SEC_CONST_32
/** @violates @ref REG_ESYS_EMIOS_H_1 Repeated include file MemMap.h */
#include "Mcl_MemMap.h"

/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/

/* This is applicable for the following lines of code */
/**
* @{
* @brief EMIOS Module Registers - global registers, mIdx : emios module index 0 for emiosA, 1 for
*        emiosB
*/

/* MCR: module configuration register */
/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_MCR_ADDR32(mIdx)             (EMIOS_BASE_ADDR32[(mIdx)] + (uint32)0x0000UL)

/* GFR: global flag register */
/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_GFR_ADDR32(mIdx)             (EMIOS_BASE_ADDR32[(mIdx)] + (uint32)0x0004UL)

