marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcl_TS_T2D35M10I0R0/include/Reg_eSys_eMios.h
/* OUDR: output update disable register */
/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_OUDR_ADDR32(mIdx)                   (EMIOS_BASE_ADDR32[(mIdx)] + (uint32)0x0008UL)

#ifdef EMIOS_UCDIS_AVAILABLE
    #if (EMIOS_UCDIS_AVAILABLE == STD_ON)
        /* UCDIS: enable/disable channel - not available on all EMIOS IP versions */
        /**
        * @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
         @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
        */
        #define EMIOS_UCDIS_ADDR32(mIdx)           (EMIOS_BASE_ADDR32[(mIdx)] + (uint32)0x000CUL)
    #endif
#endif
/**@}*/

/**
* @brief EMIOS Module Registers - offset address
*/
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_CADR_OFFSET_U32                                       ((uint32)(0x00UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_CBDR_OFFSET_U32                                       ((uint32)(0x04UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_CCNTR_OFFSET_U32                                      ((uint32)(0x08UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_CCR_OFFSET_U32                                        ((uint32)(0x0CUL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_CSR_OFFSET_U32                                        ((uint32)(0x10UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_ALTA_OFFSET_U32                                       ((uint32)(0x14UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_MCR_OFFSET_U32                                        ((uint32)(0x0000UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_OUDR_OFFSET_U32                                       ((uint32)(0x0008UL))
/** @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro */
#define EMIOS_UCDIS_OFFSET_U32                                      ((uint32)(0x000CUL))

/**
* @{
* @brief EMIOS Module Registers - Unified Channel specific registers, mIdx : emios module index 0
*        for
* emiosA, 1 for emiosB, chIdx : unified channel index
*/

/* EMIOS_BASE_ADDR32es[ module_ID ] + 0x20(uc block offset) + channel offset + register offset */
/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_CADR_ADDR32(mIdx, chIdx)    (EMIOS_BASE_ADDR32[(mIdx)] + 0x20UL + \
                                    (uint32)((uint32)(chIdx)<<(5UL)) + 0x00UL)

/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_CBDR_ADDR32(mIdx, chIdx)    (EMIOS_BASE_ADDR32[(mIdx)] + 0x20UL + \
                                    (uint32)((uint32)(chIdx)<<(5UL)) + 0x04UL)

/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_CCNTR_ADDR32(mIdx, chIdx)   (EMIOS_BASE_ADDR32[(mIdx)] + 0x20UL + \
                                    (uint32)((uint32)(chIdx)<<(5UL)) + 0x08UL)

/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_CCR_ADDR32(mIdx, chIdx)     (EMIOS_BASE_ADDR32[(mIdx)] + 0x20UL + \
                                    (uint32)((uint32)(chIdx)<<(5UL)) + 0x0CUL)

/**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_CSR_ADDR32(mIdx, chIdx)     (EMIOS_BASE_ADDR32[(mIdx)] + 0x20UL + \
                                    (uint32)((uint32)(chIdx)<<(5UL)) + 0x10UL)

 /**
* @violates @ref REG_ESYS_EMIOS_H_2 Use of function like macro
* @violates @ref REG_ESYS_EMIOS_H_3 This is not a standard library macro,
*/
#define EMIOS_ALTA_ADDR32(mIdx, chIdx)    (EMIOS_BASE_ADDR32[(mIdx)] + 0x20UL + \
                                    (uint32)((uint32)(chIdx)<<(5UL)) + 0x14UL)
/**@}*/


/* MASK and SHIFT values for each register field */
/**
* @{
* @brief MCR - Module Configuration Register - bitfield mask and shift defines.
*/
#define MCR_DOZEEN_MASK_U32     ((uint32)(BIT31))
#define MCR_DOZEEN_SHIFT        ((uint32)(31U))

#define MCR_MDIS_MASK_U32       ((uint32)(BIT30))
#define MCR_MDIS_SHIFT          ((uint32)(30U))

#define MCR_FRZ_MASK_U32        ((uint32)(BIT29))
#define MCR_FRZ_SHIFT           ((uint32)(29U))

#define MCR_GTBE_MASK_U32       ((uint32)(BIT28))
#define MCR_GTBE_SHIFT          ((uint32)(28U))

#define MCR_ETB_MASK_U32        ((uint32)(BIT27))
#define MCR_ETB_SHIFT           ((uint32)(27U))

#define MCR_GPREN_MASK_U32      ((uint32)(BIT26))
#define MCR_GPREN_SHIFT         ((uint32)(26U))

#define MCR_SRV_MASK_U32        ((uint32)(BIT19|BIT18|BIT17|BIT16))
#define MCR_SRV_SHIFT           ((uint32)(16U))

#define MCR_GPRE_MASK_U32       ((uint32)(BIT15|BIT14|BIT13|BIT12|BIT11|BIT10|BIT9|BIT8))
#define MCR_GPRE_SHIFT          ((uint32)(8U))
/**@}*/

/**
* @{
* @brief GFR - Global Flag Register - bitfield mask and shift defines.
*/
/* Mask and shift defines are not needed - read only register */
/**@}*/

/**
* @{
* @brief OUDR - Output Update Disable Register
*/
/* Mask and shift defines are not needed */
/**@}*/

/**
* @{
* @brief CADR[n] - unified channel N register A
*/
/* mask and shift defines are not needed */
/**@}*/

/**
* @{
* @brief CBDR[n] - unified channel N register B
*/
/* Mask and shift defines are not needed */
/**@}*/

/**
* @{
* @brief CCNTR[n] - unified channel N counter register
*/
/* Mask and shift defines are not needed */
/**@}*/

/**
* @{
* @brief CCR[n] - unified channel N control register
*/
#define CCR_FREN_MASK_U32           ((uint32)(BIT31))
#define CCR_FREN_SHIFT              ((uint32)(31U))

#define CCR_ODIS_MASK_U32           ((uint32)(BIT30))
#define CCR_ODIS_SHIFT              ((uint32)(30U))

#define CCR_ODISL_MASK_U32          ((uint32)(BIT29|BIT28))
#define CCR_ODISL_SHIFT             ((uint32)(28U))

#define CCR_UCPRE_MASK_U32          ((uint32)(BIT27|BIT26))
#define CCR_UCPRE_SHIFT             ((uint32)(26U))

#define CCR_UCPREN_MASK_U32         ((uint32)(BIT25))
#define CCR_UCPREN_SHIFT            ((uint32)(25U))

#define CCR_DMA_MASK_U32            ((uint32)(BIT24))
#define CCR_DMA_SHIFT               ((uint32)(24U))

#define CCR_IF_MASK_U32             ((uint32)(BIT22|BIT21|BIT20|BIT19))
#define CCR_IF_SHIFT                ((uint32)(19U))

